controllers/BookController.php

SELECT * FROM `book` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Book::findOne($id)) !== null) {