controllers/SiteController.php

    public function actionIndex()
    {
		$books = Book::find()->all();
---
SELECT * FROM `book`