views/book/_form.php


		<div class="col-md-4">
			<?= $form->field($model, 'cover')->textInput(['maxlength' => true])->hint('Insert address of the cover') ?>
			<?= $form->field($model, 'genre')->dropDownList(ArrayHelper::map(Genre::find()->select(['id', 'name'])->all(), 'id', 'name'))->hint('Choose genre'); ?>
			<?= $form->field($model, 'language')->dropDownList(ArrayHelper::map(Language::find()->select(['id', 'name'])->all(), 'id', 'name'))->hint('Choose language'); ?>
---
SELECT `id`, `name` FROM `genre`
SELECT `id`, `name` FROM `language`